---
layout: post
title: 更换 Apache/Nginx/HAProxy 证书
categories: http
description: 分别阐述如何更换 Apache/Nginx/HAProxy 证书
keywords: linux, http
---


总结一下 Apache/Nginx/HAProxy 更换证书的操作步骤及注意事项。

## 证书信任链 与 证书链

证书信任链一般由 根证书-->中间证书-->根证书 三段构成，只有当整个证书信任链上的各个证书都有效时，浏览器才会认定证书是有效的。

证书链文件是指 用户证书、中间证书和根证书 组成的证书文件，是证书部署和验证证书是否可信任环节中最重要的组成部分。

![certificate_changer_01.jpg](https://i.loli.net/2021/07/22/k7Q9WzVKxsSt53E.jpg)


 - 根证书

受信任CA证书颁发机构给自己颁发的证书,是信任链的起始点。浏览器判断根证书是否受信任主要是通过检索根证书是否在浏览器的根证书库可信任列表里。

 - 中间证书
根证书颁发机构CA对中间证书颁发机构的公钥进行数字签名得到的证书。中间证书的作用主要是为了保护根证书。因为如果直接采用根证书签发证书，一旦发生根证书泄露，将造成极大的安全问题。
中间证书可以不止一个，目前我们经常看到有两级中间证书的，原则上中间证书层数越多，根证书越安全。但是一般情况下最多也不超过2级。

- 用户证书
由中间证书CA签发给用户的证书。用户证书由中间证书证明可信。用户证书是浏览器上实际体现和使用的证书。





